{
  "id": "1e63ef1f22e211c536c65702e03c40173607df97",
  "title": "Luxembourg’s foreign minister plays down Ukraine’s 2027 EU membership prospect – Europe live",
  "summary_full": "Xavier Bettel was not happy with the Ukrainian president’s repeated requests to allow Ukraine by 2027EU enlargement commissioner Marta Kos also strongly criticised Russia for its continuing attacks on Ukraine.Arriving for the EU foreign affairs council this morning, she said:“The news we are getting from Ukraine nearly every morning are horrific. What Russia is doing. There is a state terror. It’s far beyond the war [as] they are bombing people while they are at home, freezing to death, [and] bombing passenger trains …”“I can’t speak about the years; [as] I was saying there is some level of fundamentals which have to be fulfilled. But of course, we also have to consider the very important historical moments. So we will discuss with the member states how to bridge the time we need for the accession process, and of course, to react to this situation.”“We will work until the end to get the unanimity we need for this process. This is the only way we have to keep going, working also with the Hungary, and this is what we are doing.”“After more than a decade of hostilities and almost four years of full-scale war, the people of Ukraine continue to endure immense suffering. Daily civilian casualties, widespread infrastructure destruction, and mass displacement are further exacerbating the massive humanitarian needs.With Russia’s ongoing attacks on Ukraine’s energy infrastructure, millions in the country are exposed to freezing temperatures.” Continue reading...",
  "summary_public": "Xavier Bettel was not happy with the Ukrainian president’s repeated requests to allow Ukraine by 2027EU enlargement commissioner Marta Kos also strongly criticised Russia for its continuing attacks on Ukraine.Arriving fo…",
  "url": "https://www.theguardian.com/world/live/2026/jan/29/denmark-us-greenland-ukraine-russia-germany-friedrich-merz-poland-europe-latest-news",
  "published_at": "2026-01-29T14:58:31+00:00",
  "source": "World news - The Guardian",
  "language": "en",
  "countries_detected": [
    "HU",
    "LU",
    "RU",
    "UA"
  ],
  "countries_scored": [
    "HU",
    "LU",
    "RU",
    "UA"
  ]
}