{
  "id": "b2a47d7d85600735e34ce10a076436546df6df93",
  "title": "Xi didn’t really see a point to Kier’s visit – but hey, let a hundred flowers bloom | John Crace",
  "summary_full": "Chinese leader bestows a little largesse on the British PM while getting the green light for London ‘mega embassy’Let’s face it, this was never going to be a meeting of equals. Keir Starmer had been desperate to squeeze in a trip to China for some time. Another country to tick off his list and he always feels a lot better about himself when he’s abroad. Less noise from his unhappy MPs. Plus he loved the pomp and ceremony that came with it. The large flags. The military bands. A country that treated him with respect. Almost. Besides, Mark Carney and Emmanuel Macron had both made recent trips. He had seen their holiday photos. Now it was his turn. He couldn’t bear to be left out.The Chinese? Not so much. They couldn’t really see the point. But they would schedule in a couple of meetings on the condition the UK government gave the green light to the new “mega embassy” near the Tower of London. Consider it done, said Keir. All systems go for the first prime-ministerial visit since Theresa May in 2018. Continue reading...",
  "summary_public": "Chinese leader bestows a little largesse on the British PM while getting the green light for London ‘mega embassy’Let’s face it, this was never going to be a meeting of equals. Keir Starmer had been desperate to squeeze…",
  "url": "https://www.theguardian.com/politics/2026/jan/29/xi-didnt-really-see-a-point-to-keir-visit-but-hey-let-a-hundred-flowers-bloom",
  "published_at": "2026-01-29T18:02:39+00:00",
  "source": "World news - The Guardian",
  "language": "en",
  "countries_detected": [
    "GB"
  ],
  "countries_scored": [
    "GB"
  ],
  "sentiment_by_country": {
    "GB": {
      "label": "neutral",
      "confidence": 0.0,
      "evidence": ""
    }
  },
  "sentiment_error": "No batch result returned for this item",
  "processed_at": "2026-01-31T09:27:30+00:00"
}